Revit 2024 API
RebarConstrainedHandle.IsEdgeHandle Method
 Returns true if the RebarHandleType of the RebarConstrainedHandle is 'Edge'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsEdgeHandle()
Visual Basic
Public Function IsEdgeHandle As Boolean
Visual C++
public:
bool IsEdgeHandle()
See Also
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace